run/verification/flowPastPorousSquare/baseCase/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosityModel darcyForchheimerPorosity;

// Darcy-Forchheimer force of the form:
//
//      F = alpha*muf*n^dpp*(1-n)^d1mpp*U + beta*rhof*n^fpp*(1-n)^f1mpp*|U|*U
//
// where muf and rhof are fluid viscosity and denisty.
// An added mass term of the form:
//
//      gamma*(1 - porosity)*ddt(rhof, U)
//
// can also be added to the momentum equation.

darcyForchheimerPorosityCoeffs
{
    alpha 1;
    beta 1;
    gamma 0;
}

// ************************************************************************* //
